Revit 2026 API

# View3DShowGridsOnLevels Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ShowGridsOnLevels(
	ISet<ElementId> levelsIds
)
```
```vb
Public Sub ShowGridsOnLevels (
	levelsIds As ISet(Of ElementId)
)
```
```cpp
public:
void ShowGridsOnLevels(
	ISet<ElementId^>^ levelsIds
)
```
```fsharp
member ShowGridsOnLevels :
        levelsIds : ISet<ElementId> -> unit
```

#### Parameters

levelsIds ISetElementId

#### Reference

View3D Class

Autodesk.Revit.DB Namespace